class MessagesConstants:
    ERROR = '🤷 Извините, бот сейчас не доступен, пожалуйста попробуйте позже.'
    HELLO = (
        'Добро пожаловать в Liberty Pizza!'
    )
    UNKNOWN_COMMAND = (
        '❔ Кажется, я не понял твое сообщение. '
        'Попробуй ввести другую команду или уточнить, '
        'что ты хотел сделать.'
    )
    ORDER_CANCELLED = '❌ Ваш заказ отменен.'
    PAYMENT_NOT_RECEIVED = '❌ Оплата не поступила, заказ отменён.'
    PAYMENT_OK = '✅ Оплата подтверждена! Ожидайте курьера.'
    CONTACTS = '🫡 Контакты скоро появятся'
    DEFAULT_GDPR = (
        '📃 Согласие на обработку персональных данных:\n'
        ' - Telegram ID и ник (для связи)\n'
        ' - Номер телефона (для подтверждения заказа)\n'
        ' - Адрес доставки\n'
        'Днные используются только для выполнения заказа и '
        'не передаются третьим лицам.\n'
        'Нажмите «Cогласен», чтобы продолжить.'
    )


class CommandConstants:
    start = 'Главное меню'


class OrderStatus:
    PAID = 'paid'
    AWAITING = 'awaiting'
    CANCELLED = 'cancelled'


MIN_QUANTITY = 1
MAX_QUANTITY = 32767


class InputValidationConstants:
    MESSAGE_IS_NOT_TEXT = (
        'Вы отправили файл вместо текста, '
        'пожалуйста введите текстовое сообщение.'
    )
    INCORRECT_HOUSE_NUMBER = (
        'Некорректный номер дома, пожалуйста, попробуйте еще раз.'
    )
    INCORRECT_PHONE_NUMBER = (
        'Некорректный номер телефона.\n'
        'Пожалуйста введите в формате +71234567890 или 89123456789.'
    )
    INCORRECT_QUANTITY = (
        'Некорректное количество.\n'
        f'Пожалуйста введите число от 1 до {MAX_QUANTITY}'
    )


HOUSE_NUMBER_PATTERN = r'^[\d]+[\/\-\s]?[А-Яа-яA-Za-z0-9]*$'
PHONE_PATTERN = r'^(?:\+7|8)\d{10}$'


class PaymentMethod:
    CASH = 'cash'
    CARD = 'card'
    ROBOKASSA = 'robokassa'


class ReceiptMethods:
    DELIVERY = 'delivery'
    PICKUP = 'pickup'
