class MessagesConstants:
    ERROR = '🤷 Извините, бот сейчас не доступен, пожалуйста попробуйте позже.'
    HELLO = (
        'Добро пожаловать в Liberty Pizza!'
    )
    UNKNOWN_COMMAND = (
        '❔ Кажется, я не понял твое сообщение. '
        'Попробуй ввести другую команду или уточнить, '
        'что ты хотел сделать.'
    )
    ORDER_CANCELLED = '❌ Ваш заказ отменен.'
    PAYMENT_NOT_RECEIVED = '❌ Оплата не поступила, заказ отменён.'
    PAYMENT_OK = '✅ Оплата подтверждена! Номера стикеров:'


class CommandConstants:
    start = 'Начать работу с чат-ботом.'


class OrderStatus:
    PAID = 'paid'
    AWAITING = 'awaiting'
    CANCELLED = 'cancelled'


class InputValidationConstants:
    MESSAGE_IS_NOT_TEXT = (
        'Вы отправили файл вместо текста, '
        'пожалуйста введите текстовое сообщение.'
    )
    INCORRECT_HOUSE_NUMBER = (
        'Некорректный номер дома, пожалуйста, попробуйте еще раз.'
    )
    INCORRECT_PHONE_NUMBER = (
        'Некорректный номер телефона.\n'
        'Пожалуйста введите в формате +71234567890 или 89123456789.'
    )


HOUSE_NUMBER_PATTERN = r'^[\d]+[\/\-\s]?[А-Яа-яA-Za-z0-9]*$'
PHONE_PATTERN = r'^(?:\+7|8)\d{10}$'
